<a href="https://colab.research.google.com/github/marcos-code/mod2_manipulando-e-explorando-dados-sigmoidal/blob/main/Criando_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img alt="Colaboratory logo" width="15%" src="https://raw.githubusercontent.com/carlosfab/escola-data-science/master/img/novo_logo_bg_claro.png">

#### **Data Science na Prática 2.0**
*by [sigmoidal.ai](https://sigmoidal.ai)*

---

# Criando DataFrames

No *notebook* anterior, importamos diretamente um arquivo `csv` da internet para uma estrutura *DataFrame*. Quando usamos a função `pd.read('arquivo.csv')` o Pandas já entendendo como deve agir em relação à estrutura de linhas e colunas.

<center><img src="https://raw.githubusercontent.com/carlosfab/curso_data_science_na_pratica/master/modulo_02/from_csv_to_df.png"></center>


No entanto, existe a possibilidade de criarmos na mão um *DataFrame* usando diversas técnicas.

In [1]:
import pandas as pd

#Criando DataFrames

In [4]:
# criando um dicionario
dados_dict = {
    'nome': ["Marcos", "Angelina", "Miguel", "Daiane"],
    'idade': [28, 60, 57, 27],
    'cidade': ["São Paulo", "Bahia", "SJC", "Sumaré"],
    'comprou': [True, False, False, True],
}

In [5]:
# criando um DataFrame
df = pd.DataFrame(dados_dict)
df

       nome  idade     cidade  comprou
0    Marcos     28  São Paulo     True
1  Angelina     60      Bahia    False
2    Miguel     57        SJC    False
3    Daiane     27     Sumaré     True

In [6]:
# criando id do usuário
id_usuario = [1414, 7721, 2233, 5512]

       nome  idade     cidade  comprou
0    Marcos     28  São Paulo     True
1  Angelina     60      Bahia    False
2    Miguel     57        SJC    False
3    Daiane     27     Sumaré     True

In [7]:
# associando o id do usuario a lista
df.index = id_usuario

df #ver o dataframe

          nome  idade     cidade  comprou
1414    Marcos     28  São Paulo     True
7721  Angelina     60      Bahia    False
2233    Miguel     57        SJC    False
5512    Daiane     27     Sumaré     True

In [8]:
# selecionar dataframe por id
df.loc[5512]

nome       Daiane
idade          27
cidade     Sumaré
comprou      True
Name: 5512, dtype: object

In [9]:
df.loc[1414]

nome          Marcos
idade             28
cidade     São Paulo
comprou         True
Name: 1414, dtype: object

#DataFrames a partir de listas

In [27]:
dados_listas = [["Marcos", 28, "São Paulo", True],
                ["Angelina", 60, "Bahia", False],
                ["Miguel", 57, "SJC", False],
                ["Daiane", 27, "Sumaré", True]]

# criar DataFrame
df = pd.DataFrame(dados_listas, columns = ['nome', 'idade', 'cidade', 'comprou'])

# visualizar DataFrame
df

       nome  idade     cidade  comprou
0    Marcos     28  São Paulo     True
1  Angelina     60      Bahia    False
2    Miguel     57        SJC    False
3    Daiane     27     Sumaré     True

In [28]:
#selecionando pelo index
df.index = ['a','b', 'c', 'd']

# selecionando a partir do index

df.loc['b']

nome       Angelina
idade            60
cidade        Bahia
comprou       False
Name: b, dtype: object

In [29]:
df.loc['d']

nome       Daiane
idade          27
cidade     Sumaré
comprou      True
Name: d, dtype: object

#Criando novas colunas

In [30]:
# criando coluna 'saldo'
df['saldo'] =  100.00

df

       nome  idade     cidade  comprou  saldo
a    Marcos     28  São Paulo     True  100.0
b  Angelina     60      Bahia    False  100.0
c    Miguel     57        SJC    False  100.0
d    Daiane     27     Sumaré     True  100.0

# Modificando index e colunas

In [31]:
# alterar o index do df
df.index = ['Coluna A', 'Coluna B', 'Coluna C', 'Coluna D']
df

              nome  idade     cidade  comprou  saldo
Coluna A    Marcos     28  São Paulo     True  100.0
Coluna B  Angelina     60      Bahia    False  100.0
Coluna C    Miguel     57        SJC    False  100.0
Coluna D    Daiane     27     Sumaré     True  100.0

In [32]:
# alterando o nome das colunas para maiúsculos

df.columns = ['NOME', 'IDADE', 'CIDADE', 'COMPROU', 'SALDO']
df

              NOME  IDADE     CIDADE  COMPROU  SALDO
Coluna A    Marcos     28  São Paulo     True  100.0
Coluna B  Angelina     60      Bahia    False  100.0
Coluna C    Miguel     57        SJC    False  100.0
Coluna D    Daiane     27     Sumaré     True  100.0